src/Requests/Register.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.4. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.4. -->
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://webservice.proxy.columbus.turkcelltech.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://webservice.proxy.columbus.turkcelltech.com/" name="RegisterWebServiceService">
<types>
<xsd:schema>
<xsd:import namespace="http://webservice.proxy.columbus.turkcelltech.com/" schemaLocation="register.xsd"/>
</xsd:schema>
</types>
<message name="register">
<part name="parameters" element="tns:register"/>
</message>
<message name="registerResponse">
<part name="parameters" element="tns:registerResponse"/>
</message>
<portType name="RegisterWebService">
<operation name="register">
<input message="tns:register"/>
<output message="tns:registerResponse"/>
</operation>
</portType>
<binding name="RegisterWebServicePortBinding" type="tns:RegisterWebService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="register">
<soap:operation soapAction="register"/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="RegisterWebServiceService">
<port name="RegisterWebServicePort" binding="tns:RegisterWebServicePortBinding">
<soap:address location="https://sdp.kktcell.com/Columbus/register"/>
</port>
</service>
</definitions>
